InformationRegisters/ПорядокУплатыНалоговНаМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПорядокУплатыНалоговНаМестах</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УплачиваютсяАвансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмущественныхНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПорядокУплатыНалоговНаМестах/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	СтруктураВременныеТаблицы = Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	ДляПроведения = Новый Структура("СтруктураВременныеТаблицы", СтруктураВременныеТаблицы);
	ДополнительныеСвойства.Вставить("ДляПроведения", ДляПроведения);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПередЗаписью.Период,
	|	ТаблицаПередЗаписью.Организация,
	|	ТаблицаПередЗаписью.Налог,
	|	ТаблицаПередЗаписью.РегистрацияВНалоговомОргане,
	|	ТаблицаПередЗаписью.УплачиваютсяАвансы
	|ПОМЕСТИТЬ ПорядокУплатыНалоговНаМестахПередЗаписью
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ТаблицаПередЗаписью
	|//ОтборОрганизация//";
	
	Если Отбор.Организация.Использование Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
									"//ОтборОрганизация//",
									"ГДЕ
									|	ТаблицаПередЗаписью.Организация = &Организация");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Отбор.Организация.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Период           КАК Период,
	|	Таблица.Организация      КАК Организация,
	|	НЕОПРЕДЕЛЕНО             КАК Документ
	|ПОМЕСТИТЬ ПорядокУплатыНалоговНаМестахИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТаблицаПередЗаписью.Период, МЕСЯЦ) КАК Период,
	|		ТаблицаПередЗаписью.Организация КАК Организация
	|	ИЗ
	|		ПорядокУплатыНалоговНаМестахПередЗаписью КАК ТаблицаПередЗаписью
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ТаблицаПриЗаписи
	|			ПО ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация
	|				И ТаблицаПриЗаписи.Налог = ТаблицаПередЗаписью.Налог
	|				И ТаблицаПриЗаписи.РегистрацияВНалоговомОргане = ТаблицаПередЗаписью.РегистрацияВНалоговомОргане
	|		ГДЕ
	|			(ТаблицаПриЗаписи.УплачиваютсяАвансы <> ТаблицаПередЗаписью.УплачиваютсяАвансы
	|				ИЛИ ТаблицаПриЗаписи.Период <> ТаблицаПередЗаписью.Период
	|				ИЛИ ТаблицаПриЗаписи.Организация ЕСТЬ NULL)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ТаблицаПриЗаписи.Период, МЕСЯЦ),
	|		ТаблицаПриЗаписи.Организация
	|	ИЗ
	|		РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ТаблицаПриЗаписи
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУплатыНалоговНаМестахПередЗаписью КАК ТаблицаПередЗаписью
	|			ПО ТаблицаПриЗаписи.Организация = ТаблицаПередЗаписью.Организация
	|				И ТаблицаПриЗаписи.Налог = ТаблицаПередЗаписью.Налог
	|				И ТаблицаПриЗаписи.РегистрацияВНалоговомОргане = ТаблицаПередЗаписью.РегистрацияВНалоговомОргане
	|		ГДЕ
	|			(ТаблицаПриЗаписи.УплачиваютсяАвансы <> ТаблицаПередЗаписью.УплачиваютсяАвансы
	|				ИЛИ ТаблицаПриЗаписи.Период <> ТаблицаПередЗаписью.Период
	|				ИЛИ ТаблицаПередЗаписью.Организация ЕСТЬ NULL)
	|			//ОтборОрганизация//
	|
	|	) КАК Таблица
	|
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПорядокУплатыНалоговНаМестахПередЗаписью";
	
	Если Отбор.Организация.Использование Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
							"//ОтборОрганизация//", 
							"И ТаблицаПриЗаписи.Организация = &Организация");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Отбор.Организация.Значение);
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();
	
	СтруктураВременныеТаблицы.Вставить("ПорядокУплатыНалоговНаМестахИзменение", Выборка.Количество > 0);
	
	РасчетИмущественныхНалоговПереопределяемый.СформироватьЗаданиеКРасчетуТранспортногоНалога(СтруктураВременныеТаблицы, Ложь, Истина);
	РасчетИмущественныхНалоговПереопределяемый.СформироватьЗаданиеКРасчетуЗемельногоНалога(СтруктураВременныеТаблицы, Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
